# 2) მოიძიეთ ინფორმაცია for ციკლზე და გაიარეთ control flow sololearn - ში
# 3) მომხმარებელს შემოატანინე რიცხვი, დაბეჭდე:
#    არის თუ არა რიცხვი დადებითი
#    არის თუ არა 20-ზე მეტი და 50-ზე ნაკლები
#    არის თუ არა 100-ის ტოლი ან 200-ის ტოლი
num = int(input('enter number: '))
print(num > 0)
print(num > 20 and num < 50)
print(num == 100 or num == 200)
# 4) მომხმარებელს შემოატანინე 2 ასაკი, დაბეჭდე:
#    პირველი ასაკი მეტია თუ არა მეორეზე
#    არიან თუ არა ტოლები
#    პირველი ნაკლებია თუ არა მეორეზე
age1 = int(input('enter your age: '))
age2 = int(input('enter your age: '))
print(age1 > age2)
print(age1 == age2)
print(age1 < age2)
# 5) მომხმარებელს შემოატანინე 2 რიცხვი, დაბეჭდე:
#    პირველი რიცხვი აყვანილი მეორე რიცხვის ხარისხში
#    პირველი რიცხვის ნაშთი მეორეზე გაყოფისას
#    ორივე რიცხვის ჯამი
num1 = int(input('enter num: '))
num2 = int(input('enter num: '))
print(num1 ** num2)
print(num1 % num2)
print(num1 + num2)
# 6) for ციკლით გაიარე 1-დან 10-მდე რიცხვებზე და დაბეჭდე: 
#    რიცხვი
#    არის თუ არა 5-ზე დიდი
for i in range(1, 10):
    print(i)
    print(i > 5)
# 7) for ციკლით დაბეჭდე ყველა ლუწი რიცხვი 2-დან 20-მდე.
for i in range(2, 20, 2):
    print(i)