# 1) მომხმარებელს შემოატანინეთ რიცხვი, შემდეგ for ციკლის ჩათვლით 0 დან შემოტანილი რიცხვის ჩათვლით უნდა იპოვნოთ 3სა და 5ის ჯერადი რიცხვები (ანუ ის რიცხვები რომელბიც იყოფა 3ზეც და 5ზეც) ნაპოვნი რიცხვები კი დაბეჭდეთ
num = int(input('enter any number: '))
for i in range(0, num + 1):
    if i % 3 == 0 and i % 5 == 0:
        print(i)
# 2) მომხმარებელს შემოატანინეთ რიცხვი, თქვენი დავალებაა for ციკლის მეშვეობით 0_დან მაგ რიცხვის ჩათვლით ყველა რიცხვის ჯამი გამოითვალოთ და დაბეჭდოთ ტერმინალში
number = int(input('enter any number: '))
total = 0
for i in range(0, number + 1):
    total += i
print(total)

# 3) შექმენით while ციკლი და დაბეჭდეთ 10 დან 0 ის ჩათვლით ციფრები.
i = 10

while i >= 0:
    print(i)
    i -= 1
# 4) მომხმარებლს შემოატანინეთ რიცხვი, 0 დან მაგ რიცხვის ჩათვლით გამოითვალეთ იმ რიცხვების ჯამი რომლებიც იყოფა 3 ზე 
num = int(input('enter any number: '))
sum = 0

for i in range(0, num + 1):
    if i % 3 == 0:
        sum += i
print(sum)