# 1. ორი რიცხვის შედარება

# მომხმარებელს შემოატანინე 2 რიცხვი.

# დაბეჭდე:

# არის თუ არა პირველი რიცხვი მეორეზე დიდი
# არიან თუ არა ეს რიცხვები ტოლი
# არის თუ არა პირველი რიცხვი მეორესგან განსხვავებული
num1 = int(input('enter num: '))
num2 = int(input('enter num: '))
print(num1 > num2)
print(num1 == num2)
print(num1 < num2)
# 2. ასაკის შემოწმება

# მომხმარებელს შემოატანინე ასაკი.

# დაბეჭდე:

# არის თუ არა მომხმარებელი 18 წლის ან მეტის
# არის თუ არა 13 წელზე ნაკლების
# არის თუ არა 13-დან 18 წლამდე

# გამოიყენე ლოგიკური ოპერატორები.
age1 = int(input('enter your age: '))
print(age1 >= 18)
print(age1 < 13)
print(age1 > 13 or age1 < 18)
# 3. პაროლის სიგრძის შემოწმება

# მომხმარებელს შემოატანინე პაროლი.

# დაბეჭდე:

# არის თუ არა პაროლის სიგრძე 8 ან მეტი
# არის თუ არა 8-ზე ნაკლები
# არის თუ არა ზუსტად 12 სიმბოლოიანი

# მინიშნება: გამოიყენე len().

password = input('enter pass: ')
print(len(password) >= 8)
print(len(password) < 8)
print(len(password) == 12)


# 4. რიცხვის დიაპაზონის შემოწმება

# მომხმარებელს შემოატანინე რიცხვი.

# დაბეჭდე:

# არის თუ არა რიცხვი 0-ზე მეტი
# არის თუ არა 1-დან 100-მდე
# არის თუ არა 50-ისგან განსხვავებული

# გამოიყენე and, or, not.
num3 = int(input('enter num: '))
print(num1 > 0)
print(num1 > 1 and num1 < 100)
print(num1 > 50)
 
# 5. ლუწი და კენტი რიცხვები

# მომხმარებელს შემოატანინე 2 რიცხვი.

# დაბეჭდე:

# არის თუ არა ორივე რიცხვი ლუწი
# არის თუ არა ერთ-ერთი მაინც კენტი
# არიან თუ არა ეს რიცხვები ტოლი

# მინიშნება: გამოიყენე % ოპერატორი.
num4 = int(input('enter num: '))
num5 = int(input('enter num: '))
print(num4 % 2 == 0 and num5 % 2 == 0)
print(num4 % 2 == 1 or num5 % 2 == 1)
print(num4 == num5)